In [1]:
from pandas import read_csv
age_df = read_csv("Dataset/age1.csv")

In [2]:
age_df.head()

   Age  Income
0   20   10000
1   30   15000
2   80   50000
3   50   30000
4   10    5000

In [3]:
import pandas as pd
iris_df = pd.read_csv("https://5minutesengineering.com/wp-content/uploads/2021/05/iris.csv")
iris_df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [4]:
iris_df.shape

(150, 5)

In [5]:
iris_df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [6]:
iris_df['species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [7]:
iris_df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [8]:
age_df.shape

(10, 2)

In [9]:
age_df.columns

Index(['Age', 'Income'], dtype='object')

In [10]:
age_df.dtypes

Age       int64
Income    int64
dtype: object

In [11]:
age_df.describe()

            Age       Income
count  10.00000     10.00000
mean   45.00000  27500.00000
std    22.36068  15138.25177
min    10.00000   5000.00000
25%    30.00000  16250.00000
50%    47.50000  27500.00000
75%    58.75000  38750.00000
max    80.00000  50000.00000

In [12]:
age_df.describe(include='all')

            Age       Income
count  10.00000     10.00000
mean   45.00000  27500.00000
std    22.36068  15138.25177
min    10.00000   5000.00000
25%    30.00000  16250.00000
50%    47.50000  27500.00000
75%    58.75000  38750.00000
max    80.00000  50000.00000

In [13]:
iris_df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [14]:
iris_df.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.054000      3.758667     1.198667     NaN
std         0.828066     0.433594      1.764420     0.763161     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN